#+TITLE: Dependencies

#+BEGIN_SRC elisp :session session_init
(setq org-babel-python-command "nix-shell --run python")
#+END_SRC

#+RESULTS:
: nix-shell --run python

#+BEGIN_SRC python :session session_init
import spacy
nlp = spacy.load('en_core_web_lg')
#+END_SRC

#+RESULTS:
: None


#+BEGIN_SRC python :session session_init
doc = nlp('Across the sea I saw a white-winged gull.')
#+END_SRC

#+RESULTS:
: None


#+BEGIN_SRC python :session session_init
w = doc[-2]
list(list(w.children)[1].children)[0]
def getAllChildren(w):
    lemmas = []
    for child in w.children:
        lemmas.append(child.lemma_)
        if child.children:
            for grandchild in child.children:
                lemmas.append(grandchild.lemma_)
    return lemmas

def getAllParents(w):
    lemmas = []
    for ancestor in w.ancestors:
        lemmas.append(ancestor.lemma_)
        if ancestor.ancestors:
            for grandparent in ancestor.ancestors:
                lemmas.append(grandparent.lemma_)
    return lemmas
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC python :session session_init
getAllParents(w)
#+END_SRC

#+RESULTS:
| see |
